# SlabShapeVertices Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..SlabShapeVertices Property
SlabShapeEditor Class See Also
---
All of the vertices that can be edited.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SlabShapeVertexArray SlabShapeVertices { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SlabShapeVertices As SlabShapeVertexArray
	Get
```

Visual C++
---
```text
public:
property SlabShapeVertexArray^ SlabShapeVertices {
	SlabShapeVertexArray^ get ();
}
```

# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace